print("Опция 1: 2 числа")
print("Опция 2: 3 числа")
print("Опция 3: 4 числа")
print("Опция 4: 5 числа")
print("Опция 5: 6 числа")

option = int(input("Выберите опцию для проведения операции: "))

if option == 1:
    print("Опция '1': 2 числа")
elif option == 2:
    print("Опция '2': 3 числа")
elif option == 3:
    print("Опция '3': 4 числа")
elif option == 4:
    print("Опция '4': 5 чисел")
elif option == 5:
    print("Опция '5': 6 чисел")
else:
    print("Вы ввели число не из диапазона или ввели текст")
    print("Завершите программу и введите правильное значение")

